app/controllers/games_controller.rb

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @game = Game.find(params[:id])

INSERT INTO "games" ("area", "author", "coments", "created_at", "equipment", "legend", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @game = Game.new(params[:game])

    respond_to do |format|
      if @game.save

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @game = Game.find(params[:id])

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 980190962]]
---
  def destroy
    @game = Game.find(params[:id])
    @game.destroy