app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("comments", "created_at", "fulltext", "game_id", "hint1", "hint2", "image_url", "location", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @task = Task.find(params[:id])